In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import os

from collections import Counter

In [3]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [4]:
data = pd.read_csv('/content/drive/My Drive/Colab Notebooks/data_SF/module_01/data.csv')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1890 entries, 0 to 1889
Data columns (total 16 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   imdb_id               1890 non-null   object
 1   popularity            1890 non-null   float64
 2   budget                1890 non-null   int64
 3   revenue               1890 non-null   int64
 4   original_title        1890 non-null   object
 5   cast                  1890 non-null   object
 6   director              1890 non-null   object
 7   tagline               1890 non-null   object
 8   overview              1890 non-null   object
 9   runtime               1890 non-null   int64
 10  genres                1890 non-null   object
 11  production_companies  1890 non-null   object
 12  release_date          1890 non-null   object
 13  vote_count            1890 non-null   int64
 14  vote_average          1890 non-null   float64
 15  release_year          1890 non-null   int64
dtypes: float64(2), int64(5), object(9)
memory usage: 236.4+ KB

# Предобработка датасета

In [5]:
answer_ls = [] # создадим список с ответами. сюда будем добавлять ответы по мере прохождения теста

# функция, которая определяет по номеру месяца - время года
def season(x):
  if x in [12, 1, 2]:
    return 'winter'
  elif x in [3, 4, 5]:
    return 'spring'
  elif x in [6, 7, 8]:
    return 'summer'
  else:
    return 'autumn'

# создадим колонки с релизами в разрезе номера месяца и времени года
data['release_date'] = pd.to_datetime(data['release_date'])
data['release_month'] = data['release_date'].dt.month
data['release_season'] = data['release_month'].apply(season)

# колонка с расчетом дохода
data['profit'] = data.revenue - data.budget

# 1. У какого фильма из списка самый большой бюджет?
Варианты ответов:
1. The Dark Knight Rises (tt1345836)
2. Spider-Man 3 (tt0413300)
3. Avengers: Age of Ultron (tt2395427)
4. The Warrior's Way	(tt1032751)
5. Pirates of the Caribbean: On Stranger Tides (tt1298650)

In [6]:
answer = data[data.budget == data.budget.max()].original_title.to_list()
print('Самый большой бюджет [{}$] у фильма {}'.format(data.budget.max(), answer))

Самый большой бюджет [425000000$] у фильма ["The Warrior's Way"]

In [7]:
answer_ls.append(4)

# 2. Какой из фильмов самый длительный (в минутах)
1. The Lord of the Rings: The Return of the King	(tt0167260)
2. Gods and Generals	(tt0279111)
3. King Kong	(tt0360717)
4. Pearl Harbor	(tt0213149)
5. Alexander	(tt0346491)

In [8]:
answer = data[data.runtime == data.runtime.max()].original_title.to_list()
print('Самый большой по длительности [{} мин] фильм {}'.format(data.runtime.max(), answer))

Самый большой по длительности [214 мин] фильм ['Gods and Generals']

In [9]:
answer_ls.append(2)

# 3. Какой из фильмов самый короткий (в минутах)
Варианты ответов:

1. Home on the Range	tt0299172
2. The Jungle Book 2	tt0283426
3. Winnie the Pooh	tt1449283
4. Corpse Bride	tt0121164
5. Hoodwinked!	tt0443536

In [10]:
answer = data[data.runtime == data.runtime.min()].original_title.to_list()
print('Самый короткий по длительности [{} мин] фильм {}'.format(data.runtime.min(), answer))

Самый короткий по длительности [63 мин] фильм ['Winnie the Pooh']

In [11]:
answer_ls.append(3)

# 4. Средняя длительность фильма?

Варианты ответов:
1. 115
2. 110
3. 105
4. 120
5. 100

In [12]:
answer = round(data.runtime.mean())
print('Средняя длительность фильма: {}'.format(answer))

Средняя длительность фильма: 110

In [13]:
answer_ls.append(2)

# 5. Средняя длительность фильма по медиане?
Варианты ответов:
1. 106
2. 112
3. 101
4. 120
5. 115

In [14]:
answer = data.runtime.median()
print('Медианная длительность фильма: {}'.format(answer))

Медианная длительность фильма: 106.5

In [15]:
answer_ls.append(1)

# 6. Какой самый прибыльный фильм?
Варианты ответов:
1. The Avengers	tt0848228
2. Minions	tt2293640
3. Star Wars: The Force Awakens	tt2488496
4. Furious 7	tt2820852
5. Avatar	tt0499549

In [16]:
answer = data[data.profit == data.profit.max()].original_title.to_list()
print('Самый прибыльный [{} $] фильм {}'.format(data.profit.max(), answer))

Самый прибыльный [2544505847 $] фильм ['Avatar']

In [17]:
answer_ls.append(5)

# 7. Какой фильм самый убыточный?
Варианты ответов:
1. Supernova tt0134983
2. The Warrior's Way tt1032751
3. Flushed Away	tt0424095
4. The Adventures of Pluto Nash	tt0180052
5. The Lone Ranger	tt1210819

In [18]:
answer = data[data.profit == data.profit.min()].original_title.to_list()
print('Самый убыточный [{} $] фильм {}'.format(data.profit.min(), answer))

Самый убыточный [-413912431 $] фильм ["The Warrior's Way"]

In [19]:
answer_ls.append(2)

# 8. Сколько всего фильмов в прибыли?
Варианты ответов:
1. 1478
2. 1520
3. 1241
4. 1135
5. 1398

In [20]:
answer = len(data[data.profit > 0])
print('У {} фильмов из датасета объем сборов оказался выше бюджета'.format(answer))

У 1478 фильмов из датасета объем сборов оказался выше бюджета

In [21]:
answer_ls.append(1)

# 9. Самый прибыльный фильм в 2008 году?
Варианты ответов:
1. Madagascar: Escape 2 Africa	tt0479952
2. Iron Man	tt0371746
3. Kung Fu Panda	tt0441773
4. The Dark Knight	tt0468569
5. Mamma Mia!	tt0795421

In [22]:
movie_2008 = data[data.release_year == 2008]
answer = movie_2008[movie_2008.profit == movie_2008.profit.max()].original_title.to_list()
print('Самый прибыльный фильм в 2008 году: {}'.format(answer))

Самый прибыльный фильм в 2008 году: ['The Dark Knight']

In [23]:
answer_ls.append(4)

# 10. Самый убыточный фильм за период с 2012 по 2014 (включительно)?
Варианты ответов:
1. Winter's Tale	tt1837709
2. Stolen	tt1656186
3. Broken City	tt1235522
4. Upside Down	tt1374992
5. The Lone Ranger	tt1210819

In [24]:
movie_12_14 = data[(data.release_year > 2012) & (data.release_year <= 2014)]
answer = movie_12_14[movie_12_14.profit == movie_12_14.profit.min()].original_title.to_list()
print('Самый убыточный фильм за период с 2012 по 2014 (включительно): {}'.format(answer))

Самый убыточный фильм за период с 2012 по 2014 (включительно): ['The Lone Ranger']

In [25]:
answer_ls.append(5)

# 11. Какого жанра фильмов больше всего?
Варианты ответов:
1. Action
2. Adventure
3. Drama
4. Comedy
5. Thriller

In [26]:
# данная схема используется во многих случаях в данном поекте, меняются лишь ячейки и счетчики

# создаем счетчик числа фильмов
count_movie = Counter()

# построчно проходим весь датасет. 
# жанры фильмов перечислены через разделитель "|" - используем split(). 
# переносим содержимое ячейки genres во временной список genres_list.
# подсчитываем счетчиком содержимое временного списка.

for i in range(len(data)):
  genres_list = data.iloc[i]['genres'].split('|')
  for genre in genres_list:
         count_movie[genre] += 1

# преобразуем conter в dataframe
count_movie_df = pd.DataFrame.from_records(count_movie.most_common(), columns=['genre','count'])
count_movie_df.head()

       genre  count
0      Drama    782
1     Comedy    683
2   Thriller    597
3     Action    583
4  Adventure    416

In [27]:
answer_ls.append(3)

# 12. Какого жанра среди прибыльных фильмов больше всего?
Варианты ответов:
1. Drama
2. Comedy
3. Action
4. Thriller
5. Adventure

In [28]:
movie_profit = data[data.profit > 0]
count_movie = Counter()

for i in range(len(movie_profit)):
  genres_list = movie_profit.iloc[i]['genres'].split('|')
  for genre in genres_list:
         count_movie[genre] += 1

count_movie_df = pd.DataFrame.from_records(count_movie.most_common(), columns=['genre','count'])
count_movie_df.head()

       genre  count
0      Drama    560
1     Comedy    551
2   Thriller    446
3     Action    444
4  Adventure    337

In [29]:
answer_ls.append(1)

# 13. Кто из режиссеров снял больше всего фильмов?
Варианты ответов:
1. Steven Spielberg
2. Ridley Scott 
3. Steven Soderbergh
4. Christopher Nolan
5. Clint Eastwood

In [30]:
count_movie = Counter()

for i in range(len(data)):
  director_list = data.iloc[i]['director'].split('|')
  for director in director_list:
         count_movie[director] += 1

count_movie_df = pd.DataFrame.from_records(count_movie.most_common(), columns=['director','count'])
count_movie_df.head()

            director  count
0  Steven Soderbergh     13
1       Ridley Scott     12
2     Clint Eastwood     12
3   Robert Rodriguez     11
4   Steven Spielberg     10

In [31]:
answer_ls.append(3)

# 14. Кто из режиссеров снял больше всего Прибыльных фильмов?
Варианты ответов:
1. Steven Soderbergh
2. Clint Eastwood
3. Steven Spielberg
4. Ridley Scott
5. Christopher Nolan

In [32]:
movie_profit = data[data.profit > 0]
count_movie = Counter()

for i in range(len(movie_profit)):
  director_list = movie_profit.iloc[i]['director'].split('|')
  for director in director_list:
         count_movie[director] += 1

count_movie_df = pd.DataFrame.from_records(count_movie.most_common(), columns=['director','count'])
count_movie_df.head()

            director  count
0       Ridley Scott     12
1   Steven Spielberg     10
2     Clint Eastwood     10
3  Steven Soderbergh     10
4         Shawn Levy      9

In [33]:
answer_ls.append(4)

# 15. Кто из режиссеров принес больше всего прибыли?
Варианты ответов:
1. Steven Spielberg
2. Christopher Nolan
3. David Yates
4. James Cameron
5. Peter Jackson

In [34]:
count_profit = Counter()

for i in range(len(data)):
  director_list = data.iloc[i]['director'].split('|')
  for director in director_list:
         count_profit[director] += data.iloc[i]['profit']

count_profit_df = pd.DataFrame.from_records(count_profit.most_common(), columns=['director','profit'])
count_profit_df.head()

            director      profit
0      Peter Jackson  5202593685
1        David Yates  3379295625
2  Christopher Nolan  3162548502
3        J.J. Abrams  2839169916
4        Michael Bay  2760938960

In [35]:
answer_ls.append(5)

# 16. Какой актер принес больше всего прибыли?
Варианты ответов:
1. Emma Watson
2. Johnny Depp
3. Michelle Rodriguez
4. Orlando Bloom
5. Rupert Grint

In [36]:
count_profit = Counter()

for i in range(len(data)):
  cast_list = data.iloc[i]['cast'].split('|')
  for cast in cast_list:
         count_profit[cast] += data.iloc[i]['profit']

count_profit_df = pd.DataFrame.from_records(count_profit.most_common(), columns=['cast','profit'])
count_profit_df.head()

                cast      profit
0        Emma Watson  6666245597
1   Daniel Radcliffe  6514990281
2       Rupert Grint  6408638290
3       Ian McKellen  6087375777
4  Robert Downey Jr.  5316030161

In [37]:
answer_ls.append(1)

# 17. Какой актер принес меньше всего прибыли в 2012 году?
Варианты ответов:
1. Nicolas Cage
2. Danny Huston
3. Kirsten Dunst
4. Jim Sturgess
5. Sami Gayle

In [38]:
movie_2012 = data[data.release_year == 2012]
count_profit = Counter()

for i in range(len(movie_2012)):
  cast_list = movie_2012.iloc[i]['cast'].split('|')
  for cast in cast_list:
         count_profit[cast] += movie_2012.iloc[i]['profit']

count_profit_df = pd.DataFrame.from_records(count_profit.most_common(), columns=['cast','profit'])
count_profit_df.tail()

               cast    profit
461  Malin Ã…kerman -43733509
462   Timothy Spall -51893525
463    James Kidnie -51893525
464   Heidi Hawkins -51893525
465   Kirsten Dunst -68109207

In [39]:
answer_ls.append(3)

# 18. Какой актер снялся в большем количестве высокобюджетных фильмов? (в фильмах где бюджет выше среднего по данной выборке)
Варианты ответов:
1. Tom Cruise
2. Mark Wahlberg 
3. Matt Damon
4. Angelina Jolie
5. Adam Sandler

In [40]:
movie_high_budget = data[data.budget > data.budget.mean()]
count_movie = Counter()

for i in range(len(movie_high_budget)):
  cast_list = movie_high_budget.iloc[i]['cast'].split('|')
  for cast in cast_list:
         count_movie[cast] += 1

count_movie_df = pd.DataFrame.from_records(count_movie.most_common(), columns=['cast','count'])
count_movie_df.head()

                cast  count
0         Matt Damon     18
1       Adam Sandler     17
2     Angelina Jolie     16
3         Tom Cruise     15
4  Samuel L. Jackson     15

In [41]:
answer_ls.append(3)

# 19. В фильмах какого жанра больше всего снимался Nicolas Cage?  
Варианты ответа:
1. Drama
2. Action
3. Thriller
4. Adventure
5. Crime

In [42]:
movie_cage = data[data.cast.str.contains('Nicolas Cage')]
count_movie = Counter()

for i in range(len(movie_cage)):
  genres_list = movie_cage.iloc[i]['genres'].split('|')
  for genre in genres_list:
         count_movie[genre] += 1

count_movie_df = pd.DataFrame.from_records(count_movie.most_common(), columns=['genre','count'])
count_movie_df.head()

      genre  count
0    Action     17
1  Thriller     15
2     Drama     12
3     Crime     10
4   Fantasy      8

In [43]:
answer_ls.append(2)

# 20. Какая студия сняла больше всего фильмов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [44]:
count_movie = Counter()

for i in range(len(data)):
  product_list = data.iloc[i]['production_companies'].split('|')
  for product in product_list:
         count_movie[product] += 1

count_movie_df = pd.DataFrame.from_records(count_movie.most_common(), columns=['production','count'])
count_movie_df.head()

                               production  count
0                      Universal Pictures    173
1                            Warner Bros.    168
2                      Paramount Pictures    122
3                       Columbia Pictures    117
4  Twentieth Century Fox Film Corporation    109

In [45]:
answer_ls.append(1)

# 21. Какая студия сняла больше всего фильмов в 2015 году?
Варианты ответа:
1. Universal Pictures
2. Paramount Pictures
3. Columbia Pictures
4. Warner Bros
5. Twentieth Century Fox Film Corporation

In [46]:
movie_2015 = data[data.release_year == 2015]
count_movie = Counter()

for i in range(len(movie_2015)):
  product_list = movie_2015.iloc[i]['production_companies'].split('|')
  for product in product_list:
         count_movie[product] += 1

count_movie_df = pd.DataFrame.from_records(count_movie.most_common(), columns=['production','count'])
count_movie_df.head()

                               production  count
0                            Warner Bros.     12
1                      Universal Pictures     10
2  Twentieth Century Fox Film Corporation      8
3                      Paramount Pictures      7
4                       Columbia Pictures      7

In [47]:
answer_ls.append(4)

# 22. Какая студия заработала больше всего денег в жанре комедий за все время?
Варианты ответа:
1. Warner Bros
2. Universal Pictures (Universal)
3. Columbia Pictures
4. Paramount Pictures
5. Walt Disney

In [48]:
movie_comedy = data[data.genres.str.contains('Comedy')]
count_profit = Counter()

for i in range(len(movie_comedy)):
  product_list = movie_comedy.iloc[i]['production_companies'].split('|')
  for product in product_list:
         count_profit[product] += movie_comedy.iloc[i]['profit']

count_profit_df = pd.DataFrame.from_records(count_profit.most_common(), columns=['production','profit'])
count_profit_df.head()

                               production      profit
0                      Universal Pictures  8961545581
1                    Walt Disney Pictures  7669710326
2  Twentieth Century Fox Film Corporation  5686960294
3                       Columbia Pictures  5646343696
4                    DreamWorks Animation  4789049764

In [49]:
answer_ls.append(2)

# 23. Какая студия заработала больше всего денег в 2012 году?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Columbia Pictures
4. Paramount Pictures
5. Lucasfilm

In [50]:
movie_2012 = data[data.release_year == 2012]
count_profit = Counter()

for i in range(len(movie_2012)):
  product_list = movie_2012.iloc[i]['production_companies'].split('|')
  for product in product_list:
         count_profit[product] += movie_2012.iloc[i]['profit']

count_profit_df = pd.DataFrame.from_records(count_profit.most_common(), columns=['production','profit'])
count_profit_df.head()

           production      profit
0   Columbia Pictures  2501406608
1  Universal Pictures  1981011579
2      Marvel Studios  1299557910
3        Warner Bros.  1258020056
4    Relativity Media  1032593938

In [51]:
answer_ls.append(3)

# 24. Самый убыточный фильм от Paramount Pictures
Варианты ответа:

1. K-19: The Widowmaker tt0267626
2. Next tt0435705
3. Twisted tt0315297
4. The Love Guru tt0811138
5. The Fighter tt0964517

In [52]:
movie_paramount = data[data.production_companies.str.contains('Paramount Pictures')]
answer = movie_paramount[movie_paramount.profit == movie_paramount.profit.min()].original_title.to_list()
print('Самый убыточный ({}$) фильм от Paramount Pictures - {}'.format(movie_paramount.profit.min(), answer))

Самый убыточный (-64831034$) фильм от Paramount Pictures - ['K-19: The Widowmaker']

In [53]:
answer_ls.append(1)

# 25. Какой Самый прибыльный год (заработали больше всего)?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2002
5. 2015

In [54]:
profit_year = data.groupby(['release_year'])['profit'].sum().sort_values(ascending=False).reset_index()
profit_year.head()

   release_year       profit
0          2015  18668572378
1          2014  16397812953
2          2012  16077001687
3          2013  15243179791
4          2011  14730241341

In [55]:
answer_ls.append(5)

# 26. Какой Самый прибыльный год для студии Warner Bros?
Варианты ответа:
1. 2014
2. 2008
3. 2012
4. 2010
5. 2015

In [56]:
movie_warner = data[data.production_companies.str.contains('Warner Bros')]

profit_year = movie_warner.groupby(['release_year'])['profit'].sum().sort_values(ascending=False).reset_index()
profit_year.head()

   release_year      profit
0          2014  2295464519
1          2007  2201675217
2          2008  2134595031
3          2010  1974712985
4          2011  1871393682

In [57]:
answer_ls.append(1)

# 27. В каком месяце за все годы суммарно вышло больше всего фильмов?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [58]:
count_month = data.release_month.value_counts().reset_index()
count_month.head()

   index  release_month
0      9            227
1     12            191
2     10            186
3      8            161
4      3            156

In [59]:
answer_ls.append(4)

# 28. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)
Варианты ответа:
1. 345
2. 450
3. 478
4. 523
5. 381

In [60]:
count_season = data.release_season.value_counts().reset_index()
count_season.head()

    index  release_season
0  autumn             559
1  summer             450
2  spring             445
3  winter             436

In [61]:
answer_ls.append(2)

# 29. Какой режисер выпускает (суммарно по годам) больше всего фильмов зимой?
Варианты ответов:
1. Steven Soderbergh
2. Christopher Nolan
3. Clint Eastwood
4. Ridley Scott
5. Peter Jackson

In [62]:
movie_winter = data[data.release_season == 'winter']
count_movie = Counter()

for i in range(len(movie_winter)):
  director_list = movie_winter.iloc[i]['director'].split('|')
  for director in director_list:
         count_movie[director] += 1

count_movie_df = pd.DataFrame.from_records(count_movie.most_common(), columns=['director','count'])
count_movie_df.head()

            director  count
0      Peter Jackson      7
1     Clint Eastwood      6
2  Steven Soderbergh      6
3         Shawn Levy      4
4       Nancy Meyers      4

In [63]:
answer_ls.append(5)

# 30. Какой месяц чаще всего по годам самый прибыльный?
Варианты ответа:
1. Январь
2. Июнь
3. Декабрь
4. Сентябрь
5. Май

In [64]:
count_month = Counter()

for i in data.release_year.unique():
  year_df = data[data['release_year'] == i]
  month_max_profit = year_df.groupby(['release_month'])['profit'].sum().sort_values(ascending=False)
  count_month[month_max_profit.index[0]] += +1

count_month_df = pd.DataFrame.from_records(count_month.most_common(), columns=['month','count'])
count_month_df.head()

   month  count
0      6      7
1      5      4
2     12      4
3      7      1

In [65]:
answer_ls.append(2)

# 31. Названия фильмов какой студии в среднем самые длинные по количеству символов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [66]:
# здесь используется два счетчика при проходе через датасет
count_movie = Counter()
count_len = Counter()

for i in range(len(data)):
  product_list = data.iloc[i]['production_companies'].split('|')
  for product in product_list:
         count_movie[product] += 1
         count_len[product] += len(data.iloc[i]['original_title'])
  
count_movie_df = pd.DataFrame.from_records(count_movie.most_common(), columns=['product','count_movie'])
count_len_df = pd.DataFrame.from_records(count_len.most_common(), columns=['product','sum_len_title'])

# переводим в датафрейм формат и объединяем результаты счетчиков
# находим искомую метрику
count_mean_len = count_movie_df.merge(count_len_df, on='product', how='left')
count_mean_len['mean_len_title'] = count_mean_len.sum_len_title/count_mean_len.count_movie
count_mean_len = count_mean_len.sort_values('mean_len_title', ascending=False)
count_mean_len.head()

                        product  count_movie  sum_len_title  mean_len_title
1531    Four By Two Productions            1             83            83.0
802     Jim Henson Company, The            1             59            59.0
1295              Dos Corazones            1             47            47.0
831   Museum Canada Productions            1             46            46.0
877                Polsky Films            1             46            46.0

In [67]:
answer_ls.append(5)

# 32. Названия фильмов какой студии в среднем самые длинные по количеству слов?
Варианты ответа:
1. Universal Pictures (Universal)
2. Warner Bros
3. Jim Henson Company, The
4. Paramount Pictures
5. Four By Two Productions

In [68]:
count_movie = Counter()
count_len = Counter()

for i in range(len(data)):
  product_list = data.iloc[i]['production_companies'].split('|')
  for product in product_list:
         count_movie[product] += 1
         count_len[product] += len(data.iloc[i]['original_title'].split())
  
count_movie_df = pd.DataFrame.from_records(count_movie.most_common(), columns=['product','count_movie'])
count_len_df = pd.DataFrame.from_records(count_len.most_common(), columns=['product','sum_len_word'])

count_mean_len = count_movie_df.merge(count_len_df, on='product', how='left')
count_mean_len['mean_len_word'] = count_mean_len.sum_len_word/count_mean_len.count_movie
count_mean_len = count_mean_len.sort_values('mean_len_word', ascending=False)
count_mean_len.head()

                      product  count_movie  sum_len_word  mean_len_word
1531  Four By Two Productions            1            12           12.0
802   Jim Henson Company, The            1            10           10.0
555   The Saul Zaentz Company            2            18            9.0
1295            Dos Corazones            1             9            9.0
877              Polsky Films            1             9            9.0

In [69]:
answer_ls.append(5)

# 33. Сколько разных слов используется в названиях фильмов?(без учета регистра)
Варианты ответа:
1. 6540
2. 1002
3. 2461
4. 28304
5. 3432

In [70]:
count_word = Counter()

for i in range(len(data)):
  word_list = data.iloc[i]['original_title'].lower().split(' ')
  for word in word_list:
         count_word[word] += 1

count_word_df = pd.DataFrame.from_records(count_word.most_common(), columns=['word','count'])
count_word_df.word.nunique()

2462

In [71]:
answer_ls.append(3)

# 34. Какие фильмы входят в 1 процент лучших по рейтингу?
Варианты ответа:
1. Inside Out, Gone Girl, 12 Years a Slave
2. BloodRayne, The Adventures of Rocky & Bullwinkle
3. The Lord of the Rings: The Return of the King
4. 300, Lucky Number Slevin

In [72]:
# находим величну порогового значения рейтинга
top_vote = data['vote_average'].quantile(0.99)

# фильтруем датасет по этому порогу
top_movie = data[data.vote_average >= top_vote].sort_values('vote_average', ascending=False)
top_movie = top_movie[['original_title', 'vote_average']]
top_movie

                                         original_title  vote_average
600                                     The Dark Knight           8.1
9                                            Inside Out           8.0
34                                                 Room           8.0
118                                        Interstellar           8.0
125                                  The Imitation Game           8.0
370                                           Inception           7.9
1192                                   12 Years a Slave           7.9
1184                            The Wolf of Wall Street           7.9
1082      The Lord of the Rings: The Return of the King           7.9
873                                         The Pianist           7.9
1801                                            Memento           7.9
119                             Guardians of the Galaxy           7.9
138                            The Grand Budapest Hotel           7.9
128                                           Gone Girl           7.9
283                                          Mr. Nobody           7.8
1689                                There Will Be Blood           7.8
1564              Eternal Sunshine of the Spotless Mind           7.8
1445                                       The Prestige           7.8
1214                                 Dallas Buyers Club           7.8
1206                                          Prisoners           7.8
124                                          Big Hero 6           7.8
1189                                                Her           7.8
316                                            3 Idiots           7.8
864               The Lord of the Rings: The Two Towers           7.8
155                            The Theory of Everything           7.8
28                                            Spotlight           7.8
177                              The Fault in Our Stars           7.8
497   The Lord of the Rings: The Fellowship of the Ring           7.8

In [73]:
answer_ls.append(1)

# 35. Какие актеры чаще всего снимаются в одном фильме вместе
Варианты ответа:
1. Johnny Depp & Helena Bonham Carter
2. Hugh Jackman & Ian McKellen
3. Vin Diesel & Paul Walker
4. Adam Sandler & Kevin James
5. Daniel Radcliffe & Rupert Grint

In [74]:
# решил не отходить от схемы. уверен можно сделать проще
# первым этапом прохожу через весь датасет и подсчитываю актеров.
count_cast = Counter()

for i in range(len(data)):
  cast_list = data.iloc[i]['cast'].lower().split('|')
  for cast in cast_list:
         count_cast[cast] += 1

# перевожу в формат dataframe для удобства
count_cast_df = pd.DataFrame.from_records(count_cast.most_common(), columns=['cast','count'])
# сам подсчет актеров мне не особо нужен, главное на выходе список актеров list_actors, которые встречаются в БД
list_actors = count_cast_df.cast.unique()

# вторым этапом подсчитываю сочетания актеров в фильмах
count_actors = Counter()

# использую цикл по списку найденных актеров
# прохожу построчно через весь датасет
# условие №1 - если этот актер есть в во временном списке cast_list ..
# .. то перебираем вторых актеров во временном списке
# если первый актер не совпадает со вторым актером (чтобы не возникло сочетания - (актер1, актер1) ..
# .. то счетчик фиксирует такое сочетание
for actor_first in list_actors:
  for i in range(len(data)):
    cast_list = data.iloc[i]['cast'].lower().split('|')
    if actor_first in cast_list:
      for actor_second in cast_list:
        if actor_first != actor_second:
          count_actors[(actor_first, actor_second)] += 1

count_actors_df = pd.DataFrame.from_records(count_actors.most_common(), columns=['cast','count'])
count_actors_df.head(10)

                                  cast  count
0      (emma watson, daniel radcliffe)      8
1          (emma watson, rupert grint)      8
2     (daniel radcliffe, rupert grint)      8
3      (daniel radcliffe, emma watson)      8
4     (rupert grint, daniel radcliffe)      8
5          (rupert grint, emma watson)      8
6           (owen wilson, ben stiller)      6
7  (johnny depp, helena bonham carter)      6
8           (ben stiller, owen wilson)      6
9  (helena bonham carter, johnny depp)      6

In [75]:
answer_ls.append(5)

# 36. У какого из режиссеров самый высокий процент фильмов со сборами выше бюджета?
Варианты ответа:
1. Quentin Tarantino
2. Steven Soderbergh
3. Robert Rodriguez
4. Christopher Nolan
5. Clint Eastwood

In [77]:
# два счетчика - сколько всего фильмов, сколько прибыльных фильмов
count_movie = Counter()
count_movie_profit = Counter()

# ранее мы уже подсчитывали количество фильмов у режиссеров
# здесь различие только в том, что потом идет проверка на прибыльность фильма
for i in range(len(data)):
  director_list = data.iloc[i]['director'].split('|')
  for director in director_list:
    count_movie[director] += 1
    if data.iloc[i]['revenue'] > data.iloc[i]['budget']:
      count_movie_profit[director] += 1

# переводим в dataframe формат    
count_movie_df = pd.DataFrame.from_records(count_movie.most_common(), columns=['director','count_movie'])
count_movie_profit_df = pd.DataFrame.from_records(count_movie_profit.most_common(), columns=['director','count_profit_movie'])

# объединяем полученные таблицы с целью расчета процента успешных фильмов
director_count_movie = count_movie_df.merge(count_movie_profit_df, on='director', how='left')
director_count_movie['ratio'] = director_count_movie.count_profit_movie/director_count_movie.count_movie * 100
director_count_movie = director_count_movie.sort_values(['ratio', 'count_movie'], ascending=False)
director_count_movie.head(10)

             director  count_movie  count_profit_movie  ratio
1        Ridley Scott           12                12.0  100.0
4    Steven Spielberg           10                10.0  100.0
8          Tim Burton            9                 9.0  100.0
9       Antoine Fuqua            8                 8.0  100.0
12  Christopher Nolan            8                 8.0  100.0
13      Peter Jackson            8                 8.0  100.0
14        Michael Bay            8                 8.0  100.0
15       Brett Ratner            8                 8.0  100.0
24   Francis Lawrence            6                 6.0  100.0
25         Adam McKay            6                 6.0  100.0

In [78]:
answer_ls.append(4)

# Submission

In [80]:
len(answer_ls)

36

In [81]:
pd.DataFrame({'Id':range(1,len(answer_ls)+1), 'Answer':answer_ls}, columns=['Id', 'Answer'])

    Id  Answer
0    1       4
1    2       2
2    3       3
3    4       2
4    5       1
5    6       5
6    7       2
7    8       1
8    9       4
9   10       5
10  11       3
11  12       1
12  13       3
13  14       4
14  15       5
15  16       1
16  17       3
17  18       3
18  19       2
19  20       1
20  21       4
21  22       2
22  23       3
23  24       1
24  25       5
25  26       1
26  27       4
27  28       2
28  29       5
29  30       2
30  31       5
31  32       5
32  33       3
33  34       1
34  35       5
35  36       4